eclipse-threadx/getting-started/SiliconLabs/EFR32MG12/lib/gecko_sdk_3.0.0_efr32mg12/platform/emlib/src/em_aes.c
    /* Load an initialization vector. Since writing to DATA, it will */
    /* not trigger encryption. */
    for (i = 3; i >= 0; i--) {
      AES->DATA = __REV(_iv[i]);
    }

    /* Encrypt data. */
    while (len--) {
      #if !defined(AES_CTRL_KEYBUFEN)
      /* Load key. */
      for (i = 3; i >= 0; i--) {
        AES->KEYLA = __REV(_key[i]);
      }
      #endif

      /* Load data and trigger encryption. */
      for (i = 3; i >= 0; i--) {
        AES->XORDATA = __REV(_in[i]);
      }
      _in += 4;

      /* Wait for completion. */
      while (AES->STATUS & AES_STATUS_RUNNING)
        ;

      /* Save encrypted data. */
      for (i = 3; i >= 0; i--) {
        _out[i] = __REV(AES->DATA);
      }
      _out += 4;
    }
  } else {
    /* Select decryption mode. */
    #if defined(AES_CTRL_KEYBUFEN)
    AES->CTRL = AES_CTRL_DECRYPT | AES_CTRL_KEYBUFEN | AES_CTRL_DATASTART;
    #else
    AES->CTRL = AES_CTRL_DECRYPT | AES_CTRL_DATASTART;
    #endif

    /* Copy initialization vector to the previous buffer to avoid special handling. */
    for (i = 0; i < 4; i++) {
      prev[i] = _iv[i];
    }

    /* Decrypt data. */
    while (len--) {
      #if !defined(AES_CTRL_KEYBUFEN)
      /* Load key. */
      for (i = 3; i >= 0; i--) {
        AES->KEYLA = __REV(_key[i]);
      }
      #endif

      /* Load data and trigger decryption. */
      for (i = 3; i >= 0; i--) {
        AES->DATA = __REV(_in[i]);
      }

      /* Wait for completion. */
      while (AES->STATUS & AES_STATUS_RUNNING)
        ;

      /* To avoid an additional buffer, hardware is used directly for XOR and buffer. */
      /* (Writing to XORDATA will not trigger encoding, triggering enabled on DATA.) */
      for (i = 3; i >= 0; i--) {
        AES->XORDATA = __REV(prev[i]);
        prev[i]      = _in[i];
      }
      _in += 4;

      /* Fetch decrypted data in a separate loop */
      /* due to internal auto-shifting of words. */
      for (i = 3; i >= 0; i--) {
        _out[i] = __REV(AES->DATA);
      }
      _out += 4;
    }
  }
}

#if defined(AES_CTRL_AES256)
/***************************************************************************//**
 * @brief
 *   Cipher-block chaining (CBC) cipher mode encryption/decryption, 256 bit key.
 *
 * @details
 *   See AES_CBC128() for the CBC figure.
 *
 *   See general comments on layout and byte ordering of parameters.
 *
 * @param[out] out
 *   A buffer to place encrypted/decrypted data. Must be at least @p len long. It
 *   may be set equal to @p in, in which case the input buffer is overwritten.
 *
 * @param[in] in
 *   A buffer holding data to encrypt/decrypt. Must be at least @p len long.
 *
 * @param[in] len
 *   A number of bytes to encrypt/decrypt. Must be a multiple of 16.
 *
 * @param[in] key
 *   When encrypting, this is the 256 bit encryption key. When
 *   decrypting, this is the 256 bit decryption key. The decryption key may
 *   be generated from the encryption key with AES_DecryptKey256().
 *
 * @param[in] iv
 *   128 bit initialization vector to use.
 *
 * @param[in] encrypt
 *   Set to true to encrypt, false to decrypt.
 ******************************************************************************/
void AES_CBC256(uint8_t *out,
                const uint8_t *in,
                unsigned int len,
                const uint8_t *key,
                const uint8_t *iv,
                bool encrypt)
{
  int            i;
  int            j;
  uint32_t       *_out = (uint32_t *)out;
  const uint32_t *_in  = (const uint32_t *)in;
  const uint32_t *_key = (const uint32_t *)key;
  const uint32_t *_iv  = (const uint32_t *)iv;
  /* Buffer one block when decrypting in case output replaces input. */
  uint32_t       prev[4];

  EFM_ASSERT(!(len % AES_BLOCKSIZE));

  /* A number of blocks to process. */
  len /= AES_BLOCKSIZE;

  if (encrypt) {
    /* Enable encryption with auto start using XOR. */
    AES->CTRL = AES_CTRL_AES256 | AES_CTRL_XORSTART;

    /* Load an initialization vector. Since writing to DATA, it will */
    /* not trigger encryption. */
    for (i = 3; i >= 0; i--) {
      AES->DATA = __REV(_iv[i]);
    }

    /* Encrypt data. */
    while (len--) {
      /* Load the key and data and trigger encryption. */
      for (i = 3, j = 7; i >= 0; i--, j--) {
        AES->KEYLA = __REV(_key[j]);
        AES->KEYHA = __REV(_key[i]);
        /* Write data last, since will trigger encryption on the last iteration. */
        AES->XORDATA = __REV(_in[i]);
      }
      _in += 4;

      /* Wait for completion. */
      while (AES->STATUS & AES_STATUS_RUNNING)
        ;

      /* Save encrypted data. */
      for (i = 3; i >= 0; i--) {
        _out[i] = __REV(AES->DATA);
      }
      _out += 4;
    }
  } else {
    /* Select decryption mode. */
    AES->CTRL = AES_CTRL_AES256 | AES_CTRL_DECRYPT | AES_CTRL_DATASTART;

    /* Copy the initialization vector to the previous buffer to avoid special handling. */
    for (i = 0; i < 4; i++) {
      prev[i] = _iv[i];
    }

    /* Decrypt data. */
    while (len--) {
      /* Load the key and data and trigger decryption. */
      for (i = 3, j = 7; i >= 0; i--, j--) {
        AES->KEYLA = __REV(_key[j]);
        AES->KEYHA = __REV(_key[i]);
        /* Write data last, since will trigger encryption on the last iteration. */
        AES->DATA = __REV(_in[i]);
      }

      /* Wait for completion. */
      while (AES->STATUS & AES_STATUS_RUNNING)
        ;

      /* To avoid an additional buffer, hardware is used directly for XOR and buffer. */
      for (i = 3; i >= 0; i--) {
        AES->XORDATA = __REV(prev[i]);
        prev[i]      = _in[i];
      }
      _in += 4;

      /* Fetch decrypted data in a separate loop */
      /* due to internal auto-shifting of words. */
      for (i = 3; i >= 0; i--) {
        _out[i] = __REV(AES->DATA);
      }
      _out += 4;
    }
  }
}
#endif

/***************************************************************************//**
 * @brief
 *   Cipher feedback (CFB) cipher mode encryption/decryption, 128 bit key.
 *
 * @details
 *   Encryption:
 * @verbatim
 *           InitVector    +----------------+
 *               |         |                |
 *               V         |                V
 *       +--------------+  |        +--------------+
 * Key ->| Block cipher |  |  Key ->| Block cipher |
 *       |  encryption  |  |        |  encryption  |
 *       +--------------+  |        +--------------+
 *               |         |                |
 *               V         |                V
 *  Plaintext ->XOR        |   Plaintext ->XOR
 *               |---------+                |
 *               V                          V
 *           Ciphertext                 Ciphertext
 * @endverbatim
 *   Decryption:
 * @verbatim
 *          InitVector     +----------------+
 *               |         |                |
 *               V         |                V
 *       +--------------+  |        +--------------+
 * Key ->| Block cipher |  |  Key ->| Block cipher |
 *       |  encryption  |  |        |  encryption  |
 *       +--------------+  |        +--------------+
 *               |         |                |
 *               V         |                V
 *              XOR<- Ciphertext           XOR<- Ciphertext
 *               |                          |
 *               V                          V
 *           Plaintext                  Plaintext
 * @endverbatim
 *   See general comments on layout and byte ordering of parameters.
 *
 * @param[out] out
 *   A buffer to place encrypted/decrypted data. Must be at least @p len long. It
 *   may be set equal to @p in, in which case the input buffer is overwritten.
 *
 * @param[in] in
 *   A buffer holding data to encrypt/decrypt. Must be at least @p len long.
 *
 * @param[in] len
 *   A number of bytes to encrypt/decrypt. Must be a multiple of 16.
 *
 * @param[in] key
 *   128 bit encryption key is used for both encryption and decryption modes.
 *
 * @param[in] iv
 *   128 bit initialization vector to use.
 *
 * @param[in] encrypt
 *   Set to true to encrypt, false to decrypt.
 ******************************************************************************/
void AES_CFB128(uint8_t *out,
                const uint8_t *in,
                unsigned int len,
                const uint8_t *key,
                const uint8_t *iv,
                bool encrypt)
{
  int            i;
  uint32_t       *_out = (uint32_t *)out;
  const uint32_t *_in  = (const uint32_t *)in;
  const uint32_t *_key = (const uint32_t *)key;
  const uint32_t *_iv  = (const uint32_t *)iv;
  const uint32_t *data;
  uint32_t       tmp[4];

